package jdbc.ex;

public class Ex5_Ex4_응용 {
    /* 수정 출력예시

사용자 ID를 입력하세요:summer
새 사용자 이름을 입력하세요: 초여름
새 비밀번호를 입력하세요: 1234
새 나이를 입력하세요: 25
새 이메일 주소를 입력하세요: cho@summer.com
사용자 ID summer의 정보가 성공적으로 업데이트되었습니다.

사용자 ID를 입력하세요:summer
새 사용자 이름을 입력하세요: 초여름
새 비밀번호를 입력하세요: (사용자가 입력 없이 엔터)
새 나이를 입력하세요: 25
새 이메일 주소를 입력하세요: (사용자가 입력 없이 엔터)
사용자 ID summer의 정보가 성공적으로 업데이트되었습니다.

- 비밀번호와 이메일주소는 기존값을 유지
*/

    /* 삭제 출력예시
삭제할 사용자 ID를 입력하세요: abcdef
해당 사용자 ID를 가진 사용자가 없습니다.

삭제할 사용자 ID를 입력하세요: spring
발견된 사용자 정보:
ID: spring
이름: 봄봄
이메일: spring@abc.com
나이: 25
이 사용자를 정말 삭제하시겠습니까? (y/n): n

삭제할 사용자 ID를 입력하세요: spring
발견된 사용자 정보:
ID: spring
이름: 봄봄
이메일: spring@abc.com
나이: 25
이 사용자를 정말 삭제하시겠습니까? (y/n): y
사용자 ID spring의 정보가 성공적으로 삭제되었습니다.
*/
}
